Ebiroll/artpi/qemu/hw/arm/stm32h7x7_soc.c
/*
 * STM32F405 SoC
 *
 * Copyright (c) 2014 Alistair Francis <alistair@alistair23.me>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
 * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "qemu/module.h"
#include "qemu/log.h"
#include "exec/address-spaces.h"
#include "sysemu/sysemu.h"
#include "hw/arm/stm32h750_soc.h"
#include "hw/qdev-clock.h"
#include "hw/misc/unimp.h"
#include "migration/vmstate.h"

////////////////////



static uint64_t stm32h7xx_powermgt_read(void *opaque, hwaddr offset,
                                      unsigned size)
{
    STM32H750PowerMgtState *s = (STM32H750PowerMgtState *)opaque;
    uint32_t res = 0;

    switch (offset) {
          case 0x0:
            res = s->cfg;
            static char bit_num=0;
            bit_num = bit_num +1;
            if (bit_num == 32) {
                bit_num=0;
            }
            res= (16384 | (1 << bit_num));

            qemu_log_mask(LOG_UNIMP,
                "stm32h7xx_powermgt_read: cfg offset 0x%08"HWADDR_PRIx
                " %d\n", offset,res);
                // RCC_FLAG_HSERDY
        break;

            case 0x10:
            res= s->cfg2;
          /*
             <name>SVOS</name>
              <description>System Stop mode voltage scaling
              selection These bits control the VCORE voltage level
              in system Stop mode, to obtain the best trade-off
              between power consumption and
              performance.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              */
          break;
           case 0x28:
              res = s->rpcsr;
           break;
          case 0xe8:
              res = s->hsem_lock;
           break;


          case 0x00000418:
          /*
              voltage levels ready bit for currently
              used VOS and SDLEVEL This bit is set to 1 by hardware
              when the voltage regulator and the SD converter are
              both disabled and Bypass mode is selected in PWR
              control register 3 (PWR_CR3)
          */
            res=8192;
          break;

    default:
        qemu_log_mask(LOG_UNIMP,
                      "stm32h7xx_powermgt_read: Unknown offset 0x%08"HWADDR_PRIx
                      "\n", offset);
        res = 0;
        break;
    }

    return res;
}

static void stm32h7xx_powermgt_write(void *opaque, hwaddr offset,
                                   uint64_t value, unsigned size)
{
    STM32H750PowerMgtState *s = (STM32H750PowerMgtState *)opaque;


    switch (offset) {
        case 0:
        qemu_log_mask(LOG_UNIMP,
                "stm32h7xx_powermgt_write: CFG\n");
        s->cfg = value;
        break;
        case 0x10:
           s->cfg2=value;
        break;

        /* 0x58024400
        // HSEM Read lock register
        tm32h7xx_powermgt_read: Unknown offset 0x000000e8
        stm32h7xx_powermgt_write: Unknown offset 0x000000e8


        RCC PLLs Clock Source Selection
        <resetValue>0x02020200</resetValue>
*/
    case 0xe8:
        s->hsem_lock = value;
        break;


    case 0x28:
        s->rpcsr = value;
        break;

    //case R_WDOG:
    //    qemu_log_mask(LOG_UNIMP,
    //                  "stm32h7xx_powermgt_write: WDOG\n");
    //    s->wdog = value;
    //    break;

    default:
        qemu_log_mask(LOG_UNIMP,
                      "stm32h7xx_powermgt_write: Unknown offset 0x%08"HWADDR_PRIx
                      "\n", offset);
        break;
    }
}

static const MemoryRegionOps stm32h7xx_powermgt_ops = {
    .read = stm32h7xx_powermgt_read,
    .write = stm32h7xx_powermgt_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
    .impl.min_access_size = 4,
    .impl.max_access_size = 4,
};

static const VMStateDescription vmstate_stm32h7xx_powermgt = {
    .name = TYPE_STM32H750_POWERMGT,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (VMStateField[]) {
        VMSTATE_UINT32(cfg, STM32H750PowerMgtState),
        VMSTATE_END_OF_LIST()
    }
};

static void stm32h7xx_powermgt_init(Object *obj)
{
    STM32H750PowerMgtState *s = STM32H750_POWERMGT(obj);

    memory_region_init_io(&s->iomem, obj, &stm32h7xx_powermgt_ops, s,
                          TYPE_STM32H750_POWERMGT, 0xc00);
    sysbus_init_mmio(SYS_BUS_DEVICE(s), &s->iomem);
}

static void stm32h7xx_powermgt_reset(DeviceState *dev)
{
    STM32H750PowerMgtState *s = STM32H750_POWERMGT(dev);

    s->cfg = 0x00000000;
    s->rpcsr = 0x02020200;
    s->hsem_lock=0;
}

static void stm32h7xx_powermgt_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = stm32h7xx_powermgt_reset;
    dc->vmsd = &vmstate_stm32h7xx_powermgt;
}

static const TypeInfo stm32h7xx_powermgt_info = {
    .name          = TYPE_STM32H750_POWERMGT,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(STM32H750PowerMgtState),
    .class_init    = stm32h7xx_powermgt_class_init,
    .instance_init = stm32h7xx_powermgt_init,
};

