Ebiroll/artpi/qemu/hw/arm/stm32h7x7_soc.c
/*
DTCMRAM (xrw)      : ORIGIN = 0x20000000, LENGTH = 128K
RAM_D1 (xrw)      : ORIGIN = 0x24000000, LENGTH = 512K
RAM_D2 (xrw)      : ORIGIN = 0x30000000, LENGTH = 288K
RAM_D3 (xrw)      : ORIGIN = 0x38000000, LENGTH = 64K
ITCMRAM (xrw)      : ORIGIN = 0x00000000, LENGTH = 64K

 DTCMRAM:         128 KB 
 RAM_D1:          512 KB 
 RAM_D2:          288 KB 
 RAM_D3:          64 KB  
 ITCMRAM:         64 KB  


    target_add_ram(t, 0x00000000, 0x10000);  // ITCM Ram,  64 k 
	target_add_ram(t, 0x20000000, 0x20000); // DTCM Ram, 128 k 
	target_add_ram(t, 0x24000000, 0x80000); // AXI Ram,  512 k 
	target_add_ram(t, 0x30000000, 0x20000); // AHB SRAM1, 128 k 
	target_add_ram(t, 0x30020000, 0x20000); // AHB SRAM2, 128 k 
	target_add_ram(t, 0x30040000, 0x08000); // AHB SRAM3,  32 k 
	target_add_ram(t, 0x38000000, 0x10000); // AHB SRAM4,  64 k 

*/


    // dram, olas...
    memory_region_init_ram(&s->dram, OBJECT(dev_soc), "STM32H750.dram", DRAM_SIZE,
                           &err);
    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }

    memory_region_add_subregion(system_memory, DRAM_BASE_ADDRESS,  &s->dram);

//spi_flash

    // spi_flash, olas...
    memory_region_init_ram(&s->spi_flash, OBJECT(dev_soc), "STM32H750.spiflash", 4 * SPI_FLASH__SIZE,
                           &err);
    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }

    memory_region_add_subregion(system_memory, SPI_FLASH_BASE_ADDRESS,  &s->spi_flash);



// #define SPI_FLASH_BASE_ADDRESS 0x90000000
// #define SPI_FLASH__SIZE 8 * (1024 * 1024)



    armv7m = DEVICE(&s->armv7m);
    qdev_prop_set_uint32(armv7m, "num-irq", 96);
    qdev_prop_set_string(armv7m, "cpu-type", s->cpu_type);
    // Olas, bitband??
    qdev_prop_set_bit(armv7m, "enable-bitband", true);
    qdev_connect_clock_in(armv7m, "cpuclk", s->sysclk);
    qdev_connect_clock_in(armv7m, "refclk", s->refclk);
    object_property_set_link(OBJECT(&s->armv7m), "memory",
                             OBJECT(system_memory), &error_abort);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->armv7m), errp)) {
        return;
    }

    /* System configuration controller */
    dev = DEVICE(&s->syscfg);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->syscfg), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, SYSCFG_ADD);
    sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, SYSCFG_IRQ));

    /* Attach UART (uses USART registers) and USART controllers */
    for (i = 0; i < STM_NUM_USARTS; i++) {
        dev = DEVICE(&(s->usart[i]));
        qdev_prop_set_chr(dev, "chardev", serial_hd(i));
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->usart[i]), errp)) {
            return;
        }
        busdev = SYS_BUS_DEVICE(dev);
        sysbus_mmio_map(busdev, 0, usart_addr[i]);
        sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, usart_irq[i]));
    }

    /* Timer 2 to 5 */
    for (i = 0; i < STM_NUM_TIMERS; i++) {
        dev = DEVICE(&(s->timer[i]));
        qdev_prop_set_uint64(dev, "clock-frequency", 1000000000);
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->timer[i]), errp)) {
            return;
        }
        busdev = SYS_BUS_DEVICE(dev);
        sysbus_mmio_map(busdev, 0, timer_addr[i]);
        sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, timer_irq[i]));
    }



    /* ADC device, the IRQs are ORed together */
    if (!object_initialize_child_with_props(OBJECT(s), "adc-orirq",
                                            &s->adc_irqs, sizeof(s->adc_irqs),
                                            TYPE_OR_IRQ, errp, NULL)) {
        return;
    }
    object_property_set_int(OBJECT(&s->adc_irqs), "num-lines", STM_NUM_ADCS,
                            &error_abort);
    if (!qdev_realize(DEVICE(&s->adc_irqs), NULL, errp)) {
        return;
    }
    qdev_connect_gpio_out(DEVICE(&s->adc_irqs), 0,
                          qdev_get_gpio_in(armv7m, ADC_IRQ));

    for (i = 0; i < STM_NUM_ADCS; i++) {
        dev = DEVICE(&(s->adc[i]));
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->adc[i]), errp)) {
            return;
        }
        busdev = SYS_BUS_DEVICE(dev);
        sysbus_mmio_map(busdev, 0, adc_addr[i]);
        sysbus_connect_irq(busdev, 0,
                           qdev_get_gpio_in(DEVICE(&s->adc_irqs), i));
    }

    /* SPI devices */
    for (i = 0; i < STM_NUM_SPIS; i++) {
        dev = DEVICE(&(s->spi[i]));
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->spi[i]), errp)) {
            return;
        }
        busdev = SYS_BUS_DEVICE(dev);
        sysbus_mmio_map(busdev, 0, spi_addr[i]);
        sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, spi_irq[i]));
    }
    {
        dev = DEVICE(&s->qspi);
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->qspi), errp)) {
            return;
        }
        busdev = SYS_BUS_DEVICE(dev);
        sysbus_mmio_map(busdev, 0, 0x52005000);
        sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, 92));
        
    }
   // "QUADSPI",0x52005000,0x400

    /* EXTI device */
    dev = DEVICE(&s->exti);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->exti), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, EXTI_ADDR);
    for (i = 0; i < 16; i++) {
        sysbus_connect_irq(busdev, i, qdev_get_gpio_in(armv7m, exti_irq[i]));
    }
    for (i = 0; i < 16; i++) {
        qdev_connect_gpio_out(DEVICE(&s->syscfg), i, qdev_get_gpio_in(dev, i));
    }


    /* Power Management */
    dev = DEVICE(&s->pwr);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->pwr), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x58024400);

    //create_unimplemented_device("PWR_CRC_RCC",0x58024400,0xc00);
    // STM32H750_POWERMGT

/*
    f4xx
    create_unimplemented_device("timer[7]",    0x40001400, 0x400);
    create_unimplemented_device("timer[12]",   0x40001800, 0x400);
    create_unimplemented_device("timer[6]",    0x40001000, 0x400);
    create_unimplemented_device("timer[13]",   0x40001C00, 0x400);
    create_unimplemented_device("timer[14]",   0x40002000, 0x400);
    create_unimplemented_device("RTC and BKP", 0x40002800, 0x400);
*/
/* 7x7
"Name","Start","Length"
"LPTIM1_TIM14_TIM13_TIM12_TIM7_TIM6_TIM5_TIM4_TIM3_TIM2","40000000","0x2800"
"WWDG1","40002c00","0x400"
"I2C1_I2C2_I2C3_UART5_UART4_USART3_USART2_SPDIFRX_SPI3_SPI2","40003800","0x2800"
"CEC","40006c00","0x400"
"DAC_UART7_UART8","40007400","0xc00"
"CRS_SWPMI","40008400","0x800"
"OPAMP_MDIOS","40009000","0x800"
"FDCAN1_FDCAN2_CAN_CCU","4000a000","0xc00"
"TIM1_TIM8","40010000","0x800"
"USART1_USART6","40011000","0x800"
"SPI1_SPI4","40013000","0x800"
"TIM16_TIM17_TIM15","40014000","0xc00"
"SPI5","40015000","0x400"
"SAI1_SAI2_SAI3","40015800","0xc00"
"DFSDM_HRTIM_Master_HRTIM_TIMA_HRTIM_TIMB_HRTIM_TIMC_HRTIM_TIMD_HRTIM_TIME","40017000","0x700"
"HRTIM_Common","40017780","0x80"
"DMAMUX1_DMA2_DMA1","40020000","0xc00"
"ADC1_2","40022000","0x400"
"ART","40024400","0x400"
"Ethernet_MAC","40028000","0x1400"
"OTG_HS_HOST_OTG_HS_GLOBAL_OTG_HS_DEVICE","40040000","0xd00"
"OTG_FS_HOST_OTG_FS_GLOBAL_OTG_HS_PWRCLK_OTG_FS_DEVICE","40040e00","0x3ff00"
"OTG_FS_PWRCLK","40080e00","0x3f200"
"DCMI","48020000","0x400"
"RNG_HASH_CRYP","48021000","0xc00"
"SDMMC2","48022400","0x400"
"RAMECC2","48023000","0x400"
"LTDC","50001000","0x1000"

"WWDG2","50003000","0x400"
"DMA2D_MDMA","52000000","0x1400"
"FMC_JPEG_QUADSPI","52003000","0x3000"
"SDMMC1","52007000","0x1000"
"RAMECC1","52009000","0x400"
"SYSCFG_EXTI","58000000","0x800"
"LPUART1","58000c00","0x400"
"SPI6","58001400","0x400"
"I2C4","58001c00","0x400"
"LPTIM2_LPTIM3_LPTIM4_LPTIM5","58002400","0x1000"
"COMP1_VREFBUF_RTC","58003800","0xc00"
"IWDG1_IWDG2","58004800","0x800"
"SAI4","58005400","0x400"
"GPIOA_GPIOB_GPIOC_GPIOD_GPIOE_GPIOF_GPIOG_GPIOH_GPIOI_GPIOJ_GPIOK","58020000","0x2c00"
"PWR_CRC_RCC","58024400","0xc00"
"BDMA_DMAMUX2","58025400","0x800"
"HSEM_ADC3","58026000","0x800"
"RAMECC3","58027000","0x400"
"SCB_ACTRL","e000e008","0x5"
"STK","e000e010","0x11"
"NVIC","e000e100","0x351"
"SCB","e000ed00","0x41"
"FPU_CPACR","e000ed88","0x5"
"MPU","e000ed90","0x15"
"NVIC_STIR","e000ef00","0x5"
*/

