Ebiroll/artpi/qemu/hw/arm/stm32h7x7_soc.c
////////////
    create_unimplemented_device("CEC",0x40006c00,0x400);
    create_unimplemented_device("DAC_UART7_UART8",0x40007400,0xc00);
    create_unimplemented_device("CRS_SWPMI",0x40008400,0x800);
    create_unimplemented_device("MDIOS_OPAMP",0x40009000,0x800);
    create_unimplemented_device("FDCAN1_FDCAN2_CAN_CCU",0x4000a000,0xc00);
    //create_unimplemented_device("TIM1_TIM8",0x40010000,0x800);
    //create_unimplemented_device("USART1_USART6",0x40011000,0x800);
    create_unimplemented_device("SPI1_SPI4",0x40013000,0x800);
    create_unimplemented_device("TIM16_TIM17_TIM15",0x40014000,0xc00);
    create_unimplemented_device("SPI5",0x40015000,0x400);
    create_unimplemented_device("SAI1_SAI2_SAI3",0x40015800,0xc00);
    create_unimplemented_device("HRTIM_Master_HRTIM_TIMA_HRTIM_TIMB_HRTIM_TIMC_HRTIM_TIMD_HRTIM_TIME_DFSDM",0x40017000,0x700);
    create_unimplemented_device("HRTIM_Common",0x40017780,0x80);
    create_unimplemented_device("DMAMUX1_DMA2_DMA1",0x40020000,0xc00);
    create_unimplemented_device("ADC1",0x40022000,0xd1);
    create_unimplemented_device("ADC2",0x40022100,0xd1);
    create_unimplemented_device("ADC12_Common",0x40022300,0x11);
    create_unimplemented_device("Ethernet_MAC",0x40028000,0x1400);
    create_unimplemented_device("OTG1_HS_GLOBAL_OTG1_HS_HOST_OTG1_HS_DEVICE",0x40040000,0xc00);
    create_unimplemented_device("OTG2_HS_GLOBAL_OTG2_HS_HOST_OTG2_HS_DEVICE_OTG1_HS_PWRCLK",0x40040e00,0x3fe00);
    create_unimplemented_device("OTG2_HS_PWRCLK",0x40080e00,0x3f200);
    create_unimplemented_device("DCMI",0x48020000,0x400);
    create_unimplemented_device("RNG_HASH_CRYP",0x48021000,0xc00);
    create_unimplemented_device("SDMMC2",0x48022400,0x3fd);
//    "","",""
   create_unimplemented_device("RAMECC2",0x48023000,0x400);
//    create_unimplemented_device("DELAY_Block_SDMMC2",0x48022800,0x1000);
    create_unimplemented_device("LTDC",0x50001000,0x1000);
    create_unimplemented_device("WWDG2",0x50003000,0x400);
    create_unimplemented_device("DMA2D_MDMA",0x52000000,0x1400);
    create_unimplemented_device("FMC_JPEG_QUADSPI",0x52003000,0x3000);
    create_unimplemented_device("SDMMC1",0x52007000,0x1000);
    create_unimplemented_device("RAMECC1",0x52009000,0x400);
    create_unimplemented_device("SYSCFG_EXTI",0x58000000,0x800);
    create_unimplemented_device("LPUART1",0x58000c00,0x400);
    create_unimplemented_device("SPI6",0x58001400,0x400)
    create_unimplemented_device("I2C4",0x58001c00,0x400);
    create_unimplemented_device("LPTIM2_LPTIM3_LPTIM4_LPTIM5",0x58002400,0x1000)
    create_unimplemented_device("COMP1_VREFBUF_RTC",0x58003800,0xc00);
    create_unimplemented_device("IWDG1_IWDG2",0x58004800,0x800)
    create_unimplemented_device("SAI4",0x58005400,0x400);
    create_unimplemented_device("GPIOA_GPIOB_GPIOC_GPIOD_GPIOE_GPIOF_GPIOG_GPIOH_GPIOI_GPIOJ_GPIOK",0x58020000,0x2c00);
    //create_unimplemented_device("PWR_CRC_RCC",0x58024400,0xc00);
    create_unimplemented_device("BDMA_DMAMUX2",0x58025400,0x800);
    create_unimplemented_device("HSEM_ADC3",0x58026000,0x800);
    create_unimplemented_device("RAMECC3",0x58027000,0x400);
    create_unimplemented_device("SCB_ACTRL",0xe000e008,0x5);
    create_unimplemented_device("STK",0xe000e010,0x11);
    create_unimplemented_device("NVIC",0xe000e100,0x351);
    create_unimplemented_device("SCB",0xe000ed00,0x41);
    create_unimplemented_device("FPU_CPACR",0xe000ed88,0x5);
    create_unimplemented_device("MPU",0xe000ed90,0x15);
    create_unimplemented_device("NVIC_STIR",0xe000ef00,0x5);

 /*   
    create_unimplemented_device("WWDG",0x50003000,0x400);
    create_unimplemented_device("AXI",0x51000000,0x100000);
    create_unimplemented_device("DMA2D_MDMA",0x52000000,0x1400);
                                       //   0x52005000
    create_unimplemented_device("JPEG_Flash",0x52002000,0x1400);
    create_unimplemented_device("FMC",0x52004000,0x400);
    //create_unimplemented_device("QUADSPI",0x52005000,0x400);
    create_unimplemented_device("SDMMC1_DELAY_Block_QUADSPI",0x52006000,0x13fd);
    create_unimplemented_device("DELAY_Block_SDMMC1",0x52008000,0x1000);
    create_unimplemented_device("SYSCFG_EXTI",0x58000000,0x800);
    create_unimplemented_device("LPUART1",0x58000c00,0x400);
    create_unimplemented_device("SPI6",0x58001400,0x400);
    create_unimplemented_device("I2C4",0x58001c00,0x400);
    create_unimplemented_device("LPTIM2_LPTIM3_LPTIM4_LPTIM5",0x58002400,0x1000);
    create_unimplemented_device("COMP1_VREFBUF_RTC",0x58003800,0xc00);
    create_unimplemented_device("IWDG",0x58004800,0x400);
    create_unimplemented_device("SAI4",0x58005400,0x400);
    create_unimplemented_device("GPIOA_GPIOB_GPIOC_GPIOD_GPIOE_GPIOF_GPIOG_GPIOH_GPIOI_GPIOJ_GPIOK",0x58020000,0x2c00);
    //create_unimplemented_device("PWR_CRC_RCC",0x58024400,0xc00);
    // STM32H750_POWERMGT
    create_unimplemented_device("BDMA_DMAMUX2",0x58025400,0x800);
    create_unimplemented_device("ADC3",0x58026000,0xd1);
    create_unimplemented_device("ADC3_Common",0x58026300,0x11);
    create_unimplemented_device("HSEM",0x58026400,0x400);
    create_unimplemented_device("DBGMCU",0x5c001000,0x400);
    create_unimplemented_device("SCB_ACTRL",0xe000e008,0x5);
    create_unimplemented_device("STK",0xe000e010,0x11);
    create_unimplemented_device("NVIC",0xe000e100,0x355);
    create_unimplemented_device("SCB",0xe000ed00,0x41);
    create_unimplemented_device("PF",0xe000ed78,0xd);
    create_unimplemented_device("FPU_CPACR",0xe000ed88,0x5);
    create_unimplemented_device("MPU",0xe000ed90,0x15);
    create_unimplemented_device("NVIC_STIR",0xe000ef00,0x5);
    create_unimplemented_device("FPU",0xe000ef34,0xd);
    create_unimplemented_device("AC",0xe000ef90,0x1d);
 */

}

static Property stm32h750_soc_properties[] = {
    DEFINE_PROP_STRING("cpu-type", STM32H750State, cpu_type),
    DEFINE_PROP_END_OF_LIST(),
};

static void stm32h750_soc_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = stm32h750_soc_realize;
    device_class_set_props(dc, stm32h750_soc_properties);
    /* No vmstate or reset required: device has no internal state */
}

static const TypeInfo stm32h750_soc_info = {
    .name          = TYPE_STM32H750_SOC,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(STM32H750State),
    .instance_init = stm32h750_soc_initfn,
    .class_init    = stm32h750_soc_class_init,
};

static void stm32h750_soc_types(void)
{
    type_register_static(&stm32h750_soc_info);
}

type_init(stm32h750_soc_types)
